<template>
  <footer class="footer blue-bg">
    <v-container
      class="
        d-flex
        flex-column flex-sm-row
        align-center
        justify-space-between
        py-10
      "
    >
      <div class="footer logo mb-6 mb-sm-0">
        <nuxt-link to="/">
          <svg
            width="140"
            height="40"
            viewBox="0 0 140 40"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M20.7749 10.5372C19.1005 10.5351 17.4951 9.88705 16.3111 8.73514C15.1271 7.58322 14.4609 6.02147 14.4588 4.39242V0H13.5443V4.39242C13.5592 5.20842 13.4069 6.01914 13.0962 6.77724C12.7856 7.53535 12.3228 8.22567 11.7349 8.80787C11.147 9.39007 10.4458 9.85248 9.67217 10.1682C8.89857 10.4838 8.06812 10.6464 7.22923 10.6464C6.39034 10.6464 5.55984 10.4838 4.78624 10.1682C4.01264 9.85248 3.3114 9.39007 2.72352 8.80787C2.13563 8.22567 1.67284 7.53535 1.36218 6.77724C1.05151 6.01914 0.899236 5.20842 0.914151 4.39242H-0.000427246V35.4599L13.8578 39.9534L13.9995 40L14.1414 39.9534L27.9996 35.4599V4.39242H27.085C27.0834 6.02062 26.4183 7.58178 25.2355 8.73364C24.0526 9.8855 22.4485 10.5341 20.7749 10.5372ZM22.5721 11.2035V12.7324H18.9778V11.2035C20.1568 11.4978 21.3931 11.4978 22.5721 11.2035ZM13.5423 22.236V38.6421L5.42703 32.7207V18.2885L13.5423 22.236ZM14.4568 22.236L22.5721 18.2885V32.7207L14.4568 38.6421V22.236ZM13.9995 21.459L10.6049 19.8038C10.9731 19.2526 11.477 18.7996 12.0709 18.486C12.6648 18.1724 13.3298 18.0081 14.0055 18.0081C14.6813 18.0081 15.3463 18.1724 15.9402 18.486C16.5341 18.7996 17.038 19.2526 17.4062 19.8038L13.9995 21.459ZM9.82613 13.6163L12.1185 17.4784C11.8833 17.5709 11.6557 17.6807 11.4376 17.8067L3.97731 13.626L9.82613 13.6163ZM14.4568 17.1423V13.626H17.1187L14.982 17.2239C14.8091 17.1897 14.6345 17.1645 14.4588 17.1481L14.4568 17.1423ZM13.5423 17.1423C13.3661 17.1573 13.1907 17.1813 13.0171 17.2142L10.8765 13.626H13.5383L13.5423 17.1423ZM15.8826 17.4784L18.173 13.6163H24.0258L16.5615 17.8067C16.3444 17.6832 16.1181 17.5754 15.8846 17.4842L15.8826 17.4784ZM18.0652 10.9063V12.7305H14.4708V7.80769C15.2736 9.20681 16.5409 10.2993 18.0652 10.9063ZM13.5503 7.79796V12.7207H9.9559V10.9063C11.478 10.2992 12.7432 9.20743 13.5443 7.80963L13.5503 7.79796ZM9.03538 11.1918V12.7207H5.44102V11.1918C6.62004 11.4862 7.85636 11.4862 9.03538 11.1918ZM4.52045 10.8965V12.7207H0.926095V7.79796C1.7256 9.19973 2.99083 10.2957 4.51445 10.9063L4.52045 10.8965ZM0.926095 13.6163H2.16219L10.6568 18.3876C10.3212 18.686 10.0302 19.0287 9.79219 19.4055L5.18742 17.1656C5.11846 17.1322 5.04193 17.1163 4.96496 17.1194C4.888 17.1224 4.81307 17.1444 4.74714 17.1831C4.68121 17.2219 4.6264 17.2762 4.58782 17.3411C4.54924 17.4059 4.52813 17.4792 4.52644 17.5541V19.0306L0.932092 17.2822L0.926095 13.6163ZM0.926095 18.2788L4.52045 20.0272V32.9286C4.52045 32.9977 4.53706 33.0658 4.56896 33.1276C4.60085 33.1893 4.64719 33.2429 4.70419 33.2841L11.4815 38.2302L0.920099 34.8052L0.926095 18.2788ZM27.101 34.8091L16.5396 38.2341L23.3169 33.288C23.3739 33.2468 23.4202 33.1932 23.4521 33.1315C23.484 33.0697 23.5006 33.0016 23.5006 32.9325V20.0369L27.095 18.2885L27.101 34.8091ZM27.101 17.2841L23.5066 19.0325V17.5561C23.5049 17.4812 23.4838 17.4079 23.4453 17.343C23.4067 17.2781 23.3519 17.2238 23.2859 17.1851C23.22 17.1463 23.1451 17.1244 23.0681 17.1213C22.9911 17.1183 22.9146 17.1342 22.8457 17.1676L18.2529 19.4075C18.0136 19.0314 17.7228 18.689 17.3883 18.3895L25.8529 13.626H27.087L27.101 17.2841ZM27.101 12.7227H23.5066V10.9063C25.0328 10.2973 26.3005 9.20112 27.101 7.79796V12.7227Z"
              fill="#D2840D"
            />
            <path
              d="M35.9996 15.6099L38.4222 14.5755V13.2324H35.9996V15.6099Z"
              fill="white"
            />
            <path
              d="M38.4241 15.6104H35.9996V26.7681H38.4241V15.6104Z"
              fill="white"
            />
            <path
              d="M54.4934 19.7284C55.5184 19.2064 56.4637 18.3358 56.4637 16.7127C56.479 16.2896 56.4046 15.8679 56.2452 15.4744C56.0858 15.0809 55.8449 14.7241 55.5377 14.4267C54.7496 13.6533 53.5073 13.2266 51.931 13.2266H45.7483V26.7636H52.1329C55.2058 26.7636 57.2363 25.4682 57.2363 23.0507C57.2324 21.1781 56.1085 20.2694 54.4934 19.7284ZM48.1282 15.3469H51.6224C53.1753 15.3469 54.045 16.0041 54.045 17.0614C54.045 18.3377 53.0006 18.9378 51.4457 18.9378H48.134L48.1282 15.3469ZM52.1484 24.6662H48.1282V20.9552H51.9718C53.8819 20.9552 54.8079 21.6315 54.8079 22.7726C54.8079 24.0204 53.8043 24.6586 52.1543 24.6586L52.1484 24.6662Z"
              fill="white"
            />
            <path
              d="M75.0449 17.5434C75.0449 14.9336 73.1542 13.2305 69.9221 13.2305H63.7743V26.7675H66.1989V22.0488H69.1941L72.6223 26.7675H75.4797L71.7546 21.6431C73.6861 21.102 75.0449 19.7666 75.0449 17.5434ZM66.1989 19.9419V15.3965H69.726C71.5197 15.3965 72.5835 16.1909 72.5835 17.6406C72.5835 19.0522 71.4789 19.9419 69.7454 19.9419H66.1989Z"
              fill="white"
            />
            <path
              d="M84.1784 13.2324H81.7538V26.7676H84.1784V13.2324Z"
              fill="white"
            />
            <path
              d="M96.6413 13.2305H91.499V26.7675H96.6413C100.976 26.7675 103.971 23.809 103.971 19.999C103.971 16.1508 100.976 13.2305 96.6413 13.2305ZM96.6413 24.6016H93.9236V15.3965H96.6413C99.5376 15.3965 101.428 17.351 101.428 19.999C101.428 22.687 99.5376 24.6016 96.6413 24.6016Z"
              fill="white"
            />
            <path
              d="M116.853 21.2754H120.38V23.8091C119.409 24.4881 118.243 24.847 117.051 24.834C114.232 24.834 112.361 22.7842 112.361 19.999C112.361 17.3701 114.291 15.1851 116.826 15.1851C118.573 15.1851 119.623 15.7452 120.687 16.6348L122.224 14.8364C120.805 13.6572 119.328 13 116.925 13C112.767 13 109.81 16.21 109.81 19.999C109.81 23.9824 112.648 27 116.964 27C119.078 26.9987 121.12 26.25 122.717 24.8911V19.2066H116.845L116.853 21.2754Z"
              fill="white"
            />
            <path
              d="M132.097 24.6397V21.0049H139.013V18.8789H132.097V15.3584H139.901V13.2324H129.674V26.7676H140V24.6397H132.097Z"
              fill="white"
            />
          </svg>
        </nuxt-link>
      </div>

      <div class="nav mb-6 mb-sm-0">
        <ul
          class="
            d-flex
            flex-column flex-md-row
            align-center align-sm-start
            pl-0
          "
        >
          <li class="white-color mx-4 pointer mb-4 mb-md-0">
            <div class="footer-links f14" @click="openModal('offer')">
              {{ $t('public') }}
            </div>
          </li>
          <li class="white-color mx-4 pointer">
            <div class="footer-links f14" @click="openModal('policy')">
              {{ $t('policy') }}
            </div>
          </li>
        </ul>
      </div>

      <div class="footer-social d-flex align-center">
        <a class="mt-2" href="https://vm.tiktok.com/ZSer7QmpR/" target="_blank">
          <svg
            class="mx-5"
            width="20"
            height="20"
            viewBox="0 0 20 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M14.2284 0H10.8578V13.6232C10.8578 15.2464 9.56146 16.5797 7.94819 16.5797C6.33492 16.5797 5.03854 15.2464 5.03854 13.6232C5.03854 12.029 6.30611 10.7246 7.86178 10.6667V7.24639C4.43357 7.30433 1.66797 10.1159 1.66797 13.6232C1.66797 17.1594 4.49118 20 7.97701 20C11.4628 20 14.286 17.1304 14.286 13.6232V6.63767C15.5536 7.56522 17.1092 8.11594 18.7513 8.14494V4.72464C16.2162 4.63768 14.2284 2.55072 14.2284 0Z"
              fill="white"
            />
          </svg>
        </a>

        <!-- <a
          class="mt-2"
          href="https://www.instagram.com/ibridge_consultancy/?utm_medium=copy_link"
          target="_blank"
        >
          <svg
            class="mx-5"
            width="20"
            height="20"
            viewBox="0 0 20 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M20 10C20 15.5228 15.5228 20 10 20C4.47715 20 0 15.5228 0 10C0 4.47715 4.47715 0 10 0C15.5228 0 20 4.47715 20 10ZM10.3594 7.38287C9.3867 7.78743 7.44278 8.62476 4.52757 9.89486C4.05419 10.0831 3.80621 10.2673 3.78364 10.4473C3.74549 10.7517 4.12659 10.8715 4.64556 11.0347C4.71615 11.0569 4.78929 11.0799 4.86428 11.1043C5.37486 11.2702 6.06169 11.4644 6.41874 11.4721C6.74262 11.4791 7.1041 11.3456 7.5032 11.0715C10.227 9.23293 11.633 8.3036 11.7213 8.28357C11.7835 8.26943 11.8698 8.25166 11.9283 8.30363C11.9868 8.3556 11.981 8.45403 11.9748 8.48043C11.9371 8.64138 10.4411 10.0322 9.66694 10.7519C9.42559 10.9763 9.25439 11.1354 9.2194 11.1718C9.141 11.2532 9.0611 11.3302 8.98431 11.4043C8.50997 11.8615 8.15426 12.2044 9.00401 12.7644C9.41236 13.0335 9.73913 13.256 10.0651 13.478C10.4211 13.7205 10.7762 13.9623 11.2357 14.2635C11.3527 14.3402 11.4645 14.4199 11.5734 14.4975C11.9877 14.7929 12.36 15.0583 12.8198 15.016C13.087 14.9914 13.363 14.7401 13.5032 13.9907C13.8345 12.2197 14.4857 8.38247 14.6362 6.80124C14.6494 6.6627 14.6328 6.4854 14.6195 6.40757C14.6061 6.32974 14.5783 6.21885 14.4771 6.13676C14.3573 6.03954 14.1724 6.01904 14.0896 6.0205C13.7135 6.02712 13.1365 6.22778 10.3594 7.38287Z"
              fill="white"
            />
          </svg>
        </a> -->
        <a
          class="mt-2"
          href="https://www.instagram.com/ibridge_consultancy/?utm_medium=copy_link"
          target="_blank"
        >
          <svg
            class="mx-5"
            width="20"
            height="20"
            viewBox="0 0 20 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M9.99904 0C7.28319 0 6.94264 0.0115116 5.87604 0.0601777C4.81165 0.108725 4.08472 0.277786 3.44864 0.525007C2.79106 0.780524 2.23338 1.12246 1.67741 1.67839C1.12148 2.23436 0.779547 2.79203 0.52403 3.44962C0.276809 4.08569 0.107748 4.81263 0.0592012 5.87701C0.010535 6.94362 -0.000976562 7.28416 -0.000976562 10C-0.000976562 12.7158 0.010535 13.0564 0.0592012 14.123C0.107748 15.1874 0.276809 15.9143 0.52403 16.5504C0.779547 17.208 1.12148 17.7656 1.67741 18.3216C2.23338 18.8775 2.79106 19.2195 3.44864 19.475C4.08472 19.7222 4.81165 19.8913 5.87604 19.9398C6.94264 19.9885 7.28319 20 9.99904 20C12.7149 20 13.0554 19.9885 14.122 19.9398C15.1864 19.8913 15.9133 19.7222 16.5494 19.475C17.207 19.2195 17.7647 18.8775 18.3206 18.3216C18.8766 17.7656 19.2185 17.208 19.4741 16.5504C19.7212 15.9143 19.8903 15.1874 19.9388 14.123C19.9875 13.0564 19.999 12.7158 19.999 10C19.999 7.28416 19.9875 6.94362 19.9388 5.87701C19.8903 4.81263 19.7212 4.08569 19.4741 3.44962C19.2185 2.79203 18.8766 2.23436 18.3206 1.67839C17.7647 1.12246 17.207 0.780524 16.5494 0.525007C15.9133 0.277786 15.1864 0.108725 14.122 0.0601777C13.0554 0.0115116 12.7149 0 9.99904 0ZM9.999 1.80176C12.6691 1.80176 12.9854 1.81196 14.0398 1.86007C15.0148 1.90453 15.5443 2.06744 15.8967 2.20438C16.3635 2.38579 16.6966 2.60249 17.0465 2.95244C17.3965 3.30235 17.6131 3.63547 17.7946 4.10225C17.9315 4.45462 18.0944 4.98411 18.1389 5.9591C18.187 7.01356 18.1972 7.32985 18.1972 9.99998C18.1972 12.6701 18.187 12.9864 18.1389 14.0408C18.0944 15.0158 17.9315 15.5453 17.7946 15.8977C17.6131 16.3644 17.3965 16.6976 17.0465 17.0475C16.6966 17.3974 16.3635 17.6141 15.8967 17.7955C15.5443 17.9325 15.0148 18.0954 14.0398 18.1398C12.9855 18.188 12.6693 18.1982 9.999 18.1982C7.32868 18.1982 7.01246 18.188 5.95812 18.1398C4.98313 18.0954 4.45364 17.9325 4.10127 17.7955C3.63449 17.6141 3.30137 17.3974 2.95146 17.0475C2.60155 16.6976 2.38481 16.3644 2.20341 15.8977C2.06646 15.5453 1.90355 15.0158 1.85909 14.0408C1.81098 12.9864 1.80078 12.6701 1.80078 9.99998C1.80078 7.32985 1.81098 7.01356 1.85909 5.9591C1.90355 4.98411 2.06646 4.45462 2.20341 4.10225C2.38481 3.63547 2.60151 3.30235 2.95146 2.95244C3.30137 2.60249 3.63449 2.38579 4.10127 2.20438C4.45364 2.06744 4.98313 1.90453 5.95812 1.86007C7.01258 1.81196 7.32887 1.80176 9.999 1.80176ZM4.86377 9.9999C4.86377 7.16381 7.16283 4.86475 9.99892 4.86475C12.835 4.86475 15.134 7.16381 15.134 9.9999C15.134 12.836 12.835 15.135 9.99892 15.135C7.16283 15.135 4.86377 12.836 4.86377 9.9999ZM9.99888 13.3332C8.1579 13.3332 6.66553 11.8408 6.66553 9.99986C6.66553 8.15888 8.1579 6.6665 9.99888 6.6665C11.8398 6.6665 13.3322 8.15888 13.3322 9.99986C13.3322 11.8408 11.8398 13.3332 9.99888 13.3332ZM15.3368 5.86238C15.9995 5.86238 16.5368 5.32515 16.5368 4.6624C16.5368 3.99965 15.9995 3.46238 15.3368 3.46238C14.6741 3.46238 14.1368 3.99965 14.1368 4.6624C14.1368 5.32515 14.6741 5.86238 15.3368 5.86238Z"
              fill="#F8F8F8"
            />
          </svg>
        </a>
      </div>
    </v-container>

    <div class="line"></div>

    <v-container
      class="
        py-6
        d-flex
        flex-column flex-md-row
        align-center
        justify-space-between
      "
    >
      <div class="">
        <p class="label fw-400 grey-color">
          {{ $t('rights') }}
        </p>
      </div>
      <div class="d-flex flex-column flex-md-row mt-6 mt-md-0 align-center">
        <p class="label fw-400 grey-color text-center text-md-left">
          {{ $t('contacts') }}
        </p>
        <div class="d-flex align-center orange-color mr-1 ml-2 mt-2 mt-md-0">
          <svg
            width="16"
            height="16"
            viewBox="0 0 16 16"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M13.6226 2.32349C12.1195 0.82605 10.12 0.000854494 7.99194 0C5.86865 0 3.86597 0.824463 2.35303 2.32153C0.837402 3.82117 0.00195312 5.81409 0 7.9259V7.92834V7.92981C0.000244141 9.20801 0.33606 10.4974 0.973511 11.6744L0.0218506 16L4.39722 15.0048C5.50537 15.5632 6.74182 15.8577 7.98889 15.8582H7.99207C10.115 15.8582 12.1177 15.0336 13.6309 13.5364C15.1478 12.0355 15.9836 10.0452 15.9846 7.93201C15.9852 5.83374 15.1465 3.84192 13.6226 2.32349ZM7.99194 14.6094H7.98914C6.86938 14.6089 5.75989 14.3278 4.78076 13.7961L4.57385 13.6838L1.66443 14.3456L2.29639 11.4735L2.17456 11.2634C1.56885 10.2189 1.24878 9.0658 1.24878 7.92847C1.2511 4.24719 4.27576 1.24878 7.9917 1.24878C9.78687 1.24951 11.4736 1.94543 12.7412 3.20813C14.028 4.49036 14.7363 6.16785 14.7357 7.93164C14.7343 11.6138 11.709 14.6094 7.99194 14.6094Z"
              fill="#D2840D"
            />
            <path
              d="M5.81726 4.43311H5.46692C5.34497 4.43311 5.14697 4.47876 4.97949 4.66101C4.81189 4.84338 4.3396 5.28418 4.3396 6.18066C4.3396 7.07715 4.99475 7.94336 5.08606 8.06506C5.17749 8.18664 6.35071 10.0851 8.20886 10.8154C9.75317 11.4224 10.0675 11.3016 10.4026 11.2712C10.7378 11.241 11.4843 10.8306 11.6366 10.4051C11.7889 9.97973 11.7889 9.61499 11.7433 9.53881C11.6975 9.46289 11.5756 9.41735 11.3928 9.32629C11.21 9.2351 10.314 8.78686 10.1464 8.72595C9.97876 8.66528 9.85693 8.63488 9.73499 8.81738C9.61304 8.99951 9.25403 9.42089 9.14734 9.54248C9.04077 9.66418 8.93408 9.67944 8.75122 9.58825C8.56836 9.49682 7.9856 9.30102 7.28723 8.68042C6.74365 8.19738 6.36646 7.58142 6.25977 7.39905C6.1532 7.21679 6.24841 7.11816 6.34009 7.02722C6.42224 6.94568 6.5332 6.8341 6.62463 6.72778C6.71594 6.62134 6.74194 6.54541 6.80298 6.42383C6.86389 6.30224 6.83337 6.1958 6.78772 6.10474C6.74194 6.01355 6.39111 5.11255 6.22852 4.7522H6.22864C6.09168 4.44873 5.94751 4.43848 5.81726 4.43311Z"
              fill="#D2840D"
            />
          </svg>

          <a
            href="tel:+77011118764"
            target="_blank"
            class="label orange-color ml-1"
          >
            +7 701 111 87 64
          </a>
        </div>
      </div>
    </v-container>

    <v-dialog
      v-model="modal"
      width="1120"
      hight="640"
      :fullscreen="$vuetify.breakpoint.xsOnly"
      class=""
    >
      <div class="close pointer" @click="modal = false">
        <svg
          width="28"
          height="28"
          viewBox="0 0 28 28"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M21 7L7 21"
            stroke="black"
            stroke-width="2"
            stroke-linecap="square"
            stroke-linejoin="round"
          />
          <path
            d="M7 7L21 21"
            stroke="black"
            stroke-width="2"
            stroke-linecap="square"
            stroke-linejoin="round"
          />
        </svg>
      </div>
      <v-card>
        <div class="content pa-10">
          <h3 class="mb-6">
            {{ $t(modal_type == 'offer' ? 'public' : 'policy') }}
          </h3>
          <div
            v-if="$i18n.locale == 'ru' && modal_type == 'offer'"
            class="h5 fw-400"
          >
            <br />1.Общие положения
            <br />
            <br />1.1. Внимательно ознакомьтесь с текстом публичной оферты, и
            если Вы не согласны с каким-либо пунктом оферты, Вам предлагается
            отказаться от покупки Услуг, предоставляемых Продавцом. <br />1.2. В
            соответствии со статьей 395 Гражданского Кодекса Республики
            Казахстан (далее - ГК РК) данный документ является публичной
            офертой, и в случае принятия изложенных ниже условий физическое
            лицо, производящее акцепт этой оферты, осуществляет оплату Товара
            Продавца в соответствии с условиями настоящего Договора. В
            соответствии с пунктом 3 статьи 396 ГК РК, оплата Товара Покупателем
            является акцептом оферты, что считается равносильным заключению
            Договора на условиях, изложенных в оферте. <br />1.3. В настоящей
            оферте, если контекст не требует иного, нижеприведенные термины
            имеют следующие значения: <br />«Оферта» — публичное предложение
            Продавца, адресованное любому физическому/юридическому лицу,
            заключить с ним договор купли-продажи (далее — «Договор») на
            существующих условиях, содержащихся в Договоре, включая все его
            приложения. <br />«Продавец» — компания, реализующая Услугу,
            представленный на сайте iBridge.com <br />«Покупатель» — физическое
            или юридическое лицо, заключившее с Продавцом Договор на условиях,
            содержащихся в Договоре. <br />«Акцепт» — полное и безоговорочное
            принятие Покупателем условий Договора. <br />«Услуга» — перечень
            наименований Услуг, представленный на сайте iBridge.com
            <br />«Заказ» — позиции из ассортиментного перечня Услуг, указанные
            Покупателем при размещении заявки на интернет-сайте iBridge.com
            <br />Сайт – совокупность электронных документов (файлов) Продавца,
            доступных в сети Интернет по адресу iBridge.com
            <br />
            <br />2. Предмет договора
            <br />
            <br />2.1. Продавец продает Услугу в соответствии с действующим
            прейскурантом, опубликованным на интернет-сайте Продавца, а
            Покупатель производит оплату и принимает Услугу в соответствии с
            условиями настоящего Договора. <br />2.2. Настоящий Договор и все
            приложения к нему являются официальными документами Продавца и
            неотъемлемой частью Оферты.
            <br />
            <br />
            <br />3. Размещение Заказа
            <br />
            <br />3.1. Заказ Услуги осуществляется Покупателем через интернет на
            сайте iBridge.com. <br />3.2. При регистрации (размещении) Заказа на
            интернет-сайте Продавца, Покупатель обязуется предоставить
            регистрационную информацию о себе. <br />3.3. Принятие Покупателем
            условий настоящего Договора осуществляется посредством внесения
            Покупателем соответствующих данных в регистрационную форму на
            интернет-сайте. Покупатель имеет право редактировать регистрационную
            информацию о себе. Продавец обязуется не сообщать регистрационные
            данные Покупателя, а также иную информацию, касающуюся личных данных
            Покупателя, лицам, не имеющим отношения к исполнению Заказа.
            Утвердив Заказ выбранной Услуги, Покупатель предоставляет
            необходимую информацию по оказанию Услуги. <br />3.4. Покупатель
            несет ответственность за содержание и достоверность информации,
            предоставленной при размещении Заказа. <br />3.5. В случае
            возникновения у Покупателя вопросов, касающихся оказания Услуги,
            дополнительных сведений по процессу получения Услуги, перед
            размещением Заказа ему необходимо обратиться за консультацией или
            послать запрос на адрес электронной почты.
            <br />
            <br />4.Сроки исполнения Заказа <br />4.1. Срок, в который Продавец
            обязуется начать исполнять Заказ, составляет от одного до десяти
            рабочих дня. Срок исполнения Заказа в исключительных случаях может
            быть оговорен с Покупателем индивидуально в зависимости от
            дополнительных сведений <br />4.2. Стоимость и условия оказания
            Заказа Покупатель уточняет на интернет-сайте Продавца. <br />4.3. В
            случае предоставления Покупателем недостоверной информации о его
            контактных данных или составе Заказа, Продавец за ненадлежащее
            исполнение Заказа ответственности не несет.
            <br />
            <br />5. Оплата Заказа
            <br />
            <br />5.1. Оплата исполненного Заказа по выбору Покупателя может,
            осуществляется: <br />путем перечисления денежных средств на
            расчетный счет Продавца; <br />путем перечисления Покупателем
            денежных средств в режиме онлайн через систему электронных платежей
            следующими платежными средствами: <br />- кредитные карты (VISA,
            EuroCard/MasterCard);
            <br />
            <br />5.2. Цены на любые Услуги, указанные на интернет-сайте, могут
            быть изменены Продавцом в одностороннем порядке без уведомления
            Покупателя. <br />5.3. Цена на любую Услугу отображает только
            стоимость Услуги без учета дополнительных затрат. <br />5.4. Оплата
            Покупателем самостоятельно размещенного Заказа на интернет-сайте
            означает согласие с Условиями настоящего Договора. День оплаты
            Заказа является датой заключения Договора оферты между Продавцом и
            Покупателем.
            <br />
            <br />6. Расторжение договора
            <br />
            <br />6.1. В случае расторжения Договора по инициативе Покупателя
            (по независящим обстоятельствам от Продавца), возврат суммы
            осуществляется в размере 50% от остатка суммы за оплату Услуги в
            текущем месяце.
            <br />
            <br />7. Прочие условия
            <br />
            <br />7.1. Настоящим Покупатель соглашается с обязательными
            условиями настоящего Договора публичной оферты.
            <br />
            <br />7.2. В соответствии с условиями настоящего Договора публичной
            оферты Продавец имеет право отказать в размещении Заказа лицам,
            выражающим несогласие с условиями настоящего Договора.
            <br />
            <br />7.3. Продавец оставляет за собой право вносить изменения в
            настоящее Соглашение, в связи с чем Покупатель обязуется регулярно
            отслеживать изменения в Соглашении, опубликованном на сайте
            iBridge.com.
          </div>
          <div
            v-if="$i18n.locale == 'en' && modal_type == 'offer'"
            class="h5 fw-400"
          >
            <br />1. General Provisions
            <br />
            <br />1.1. Carefully read the text of the public offer, and if you
            do not agree with any clause of the offer, you are invited to refuse
            to purchase the Services provided by the Seller. <br />1.2. In
            accordance with Article 395 of the Civil Code of the Republic of
            Kazakhstan (hereinafter referred to as the Civil Code of the
            Republic of Kazakhstan), this document is a public offer, and if the
            conditions set out below are accepted, the individual who accepts
            this offer pays for the Seller's Goods in accordance with the terms
            of this Agreement. In accordance with paragraph 3 of Article 396 of
            the Civil Code of the Republic of Kazakhstan, payment for the Goods
            by the Buyer is an acceptance of the offer, which is considered
            equivalent to the conclusion of the Agreement on the conditions set
            forth in the offer. <br />1.3. In this offer, unless the context
            requires otherwise, the following terms have the following meanings:
            <br />"Offer" - a public offer of the Seller, addressed to any
            individual / legal entity, to conclude a sale and purchase agreement
            with him (hereinafter referred to as the "Agreement") on the
            existing conditions contained in the Agreement, including all its
            annexes. <br />"Seller" - a company that implements the Service,
            presented on the website iBridge.com <br />"Buyer" - a natural or
            legal person who has entered into an Agreement with the Seller on
            the terms contained in the Agreement. <br />"Acceptance" - full and
            unconditional acceptance by the Buyer of the terms of the Agreement.
            <br />"Service" - a list of the names of the Services presented on
            the website iBridge.com <br />"Order" - items from the assortment
            list of Services specified by the Buyer when placing an order on the
            iBridge.com website <br />Site - a set of electronic documents
            (files) of the Seller available on the Internet at iBridge.com
            <br />
            <br />2. Subject of the contract
            <br />
            <br />2.1. The Seller sells the Service in accordance with the
            current price list published on the Seller's website, and the Buyer
            pays for and accepts the Service in accordance with the terms of
            this Agreement. <br />2.2. This Agreement and all its annexes are
            official documents of the Seller and an integral part of the Offer.
            <br />
            <br />
            <br />3. Placing an Order
            <br />
            <br />3.1. The Service is ordered by the Buyer via the Internet at
            the iBridge.com website. <br />3.2. When registering (placing) an
            Order on the Seller's website, the Buyer undertakes to provide
            registration information about himself. <br />3.3. The Buyer's
            acceptance of the terms of this Agreement is carried out by the
            Buyer entering the relevant data into the registration form on the
            website. The buyer has the right to edit the registration
            information about himself. The Seller undertakes not to disclose the
            Buyer's registration data, as well as other information regarding
            the Buyer's personal data, to persons not related to the execution
            of the Order. Having approved the Order of the selected Service, the
            Buyer provides the necessary information for the provision of the
            Service. <br />3.4. The Buyer is responsible for the content and
            accuracy of the information provided when placing the Order.
            <br />3.5. If the Buyer has any questions regarding the provision of
            the Service, additional information on the process of obtaining the
            Service, before placing the Order, he must seek advice or send a
            request to the e-mail address.
            <br />
            <br />4. Terms of order execution <br />4.1. The period within which
            the Seller undertakes to start fulfilling the Order is from one to
            ten working days. In exceptional cases, the deadline for the
            execution of the Order can be negotiated with the Buyer
            individually, depending on additional information <br />4.2. The
            Buyer specifies the cost and conditions for the provision of the
            Order on the Seller's website. <br />4.3. If the Buyer provides
            inaccurate information about his contact information or the
            composition of the Order, the Seller is not responsible for improper
            execution of the Order.
            <br />
            <br />5. Payment for the Order
            <br />
            <br />5.1. Payment for the executed Order, at the option of the
            Buyer, may be carried out: <br />by transferring funds to the
            Seller's account; <br />by transferring funds by the Buyer online
            through the electronic payment system by the following means of
            payment: <br />- credit cards (VISA, EuroCard / MasterCard);
            <br />
            <br />5.2. Prices for any Services indicated on the website may be
            changed by the Seller unilaterally without notifying the Buyer.
            <br />5.3. The price for any Service reflects only the cost of the
            Service, excluding additional costs. <br />5.4. Payment by the Buyer
            for an Order placed independently on the website means acceptance of
            the Terms of this Agreement. The day of payment for the Order is the
            date of the conclusion of the Offer Agreement between the Seller and
            the Buyer.
            <br />
            <br />6. Termination of the contract
            <br />
            <br />6.1. In case of termination of the Agreement on the initiative
            of the Buyer (due to circumstances beyond the control of the
            Seller), the amount is refunded in the amount of 50% of the
            remaining amount for payment for the Service in the current month.
            <br />
            <br />7. Other conditions
            <br />
            <br />7.1. The Buyer hereby agrees with the mandatory terms of this
            Public Offer Agreement.
            <br />
            <br />7.2. In accordance with the terms of this Public Offer
            Agreement, the Seller has the right to refuse to place an Order to
            persons who disagree with the terms of this Agreement.
            <br />
            <br />7.3. The Seller reserves the right to make changes to this
            Agreement, in connection with which the Buyer undertakes to
            regularly monitor changes in the Agreement published on the
            iBridge.com website.
          </div>

          <div
            v-if="$i18n.locale == 'ru' && modal_type == 'policy'"
            class="h5 fw-400"
          >
            <br />1.iBridge (далее – Оператор) верна принципу сохранения
            конфиденциальности своих клиентов.
            <br />
            <br />1.1. Оператор ставит своей важнейшей целью и условием
            осуществления своей деятельности соблюдение прав и свобод человека и
            гражданина при обработке его персональных данных, в том числе защиты
            прав на неприкосновенность частной жизни, личную и семейную тайну.
            <br />1.2. Настоящая политика Оператора в отношении обработки
            персональных данных (далее – Политика) применяется ко всей
            информации, которую Оператор может получить о посетителях веб-сайта
            https://iBridge.com.
            <br />
            <br />2. Основные понятия, используемые в Политике <br />2.1.
            Автоматизированная обработка персональных данных – обработка
            персональных данных с помощью средств вычислительной техники.
            <br />2.2. Блокирование персональных данных – временное прекращение
            обработки персональных данных (за исключением случаев, если
            обработка необходима для уточнения персональных данных). <br />2.3.
            Веб-сайт – совокупность графических и информационных материалов, а
            также программ для ЭВМ и баз данных, обеспечивающих их доступность в
            сети интернет по сетевому адресу https://iBridge.com. <br />2.4.
            Информационная система персональных данных — совокупность
            содержащихся в базах данных персональных данных, и обеспечивающих их
            обработку информационных технологий и технических средств.
            <br />2.5. Обезличивание персональных данных — действия, в
            результате которых невозможно определить без использования
            дополнительной информации принадлежность персональных данных
            конкретному Пользователю или иному субъекту персональных данных.
            <br />2.6. Обработка персональных данных – любое действие (операция)
            или совокупность действий (операций), совершаемых с использованием
            средств автоматизации или без использования таких средств с
            персональными данными, включая сбор, запись, систематизацию,
            накопление, хранение, уточнение (обновление, изменение), извлечение,
            использование, передачу (распространение, предоставление, доступ),
            обезличивание, блокирование, удаление, уничтожение персональных
            данных. <br />2.7. Оператор – государственный орган, муниципальный
            орган, юридическое или физическое лицо, самостоятельно или совместно
            с другими лицами организующие и (или) осуществляющие обработку
            персональных данных, а также определяющие цели обработки
            персональных данных, состав персональных данных, подлежащих
            обработке, действия (операции), совершаемые с персональными данными.
            <br />2.8. Персональные данные – любая информация, относящаяся прямо
            или косвенно к определенному или определяемому Пользователю
            веб-сайта https://iBridge.com. <br />2.9. Персональные данные,
            разрешенные субъектом персональных данных для распространения, -
            персональные данные, доступ неограниченного круга лиц к которым
            предоставлен субъектом персональных данных путем дачи согласия на
            обработку персональных данных, разрешенных субъектом персональных
            данных для распространения в порядке, предусмотренном Законом о
            персональных данных (далее - персональные данные, разрешенные для
            распространения). <br />2.10. Пользователь – любой посетитель
            веб-сайта https://iBridge.com. <br />2.11. Предоставление
            персональных данных – действия, направленные на раскрытие
            персональных данных определенному лицу или определенному кругу лиц.
            <br />2.12. Распространение персональных данных – любые действия,
            направленные на раскрытие персональных данных неопределенному кругу
            лиц (передача персональных данных) или на ознакомление с
            персональными данными неограниченного круга лиц, в том числе
            обнародование персональных данных в средствах массовой информации,
            размещение в информационно-телекоммуникационных сетях или
            предоставление доступа к персональным данным каким-либо иным
            способом. <br />2.13. Трансграничная передача персональных данных –
            передача персональных данных на территорию иностранного государства
            органу власти иностранного государства, иностранному физическому или
            иностранному юридическому лицу. <br />2.14. Уничтожение персональных
            данных – любые действия, в результате которых персональные данные
            уничтожаются безвозвратно с невозможностью дальнейшего
            восстановления содержания персональных данных в информационной
            системе персональных данных и (или) уничтожаются материальные
            носители персональных данных.
            <br />
            <br />3. Основные права и обязанности Оператора <br />3.1. Оператор
            имеет право: <br />– получать от субъекта персональных данных
            достоверные информацию и/или документы, содержащие персональные
            данные; <br />– в случае отзыва субъектом персональных данных
            согласия на обработку персональных данных Оператор вправе продолжить
            обработку персональных данных без согласия субъекта персональных
            данных при наличии оснований, указанных в Законе о персональных
            данных; <br />– самостоятельно определять состав и перечень мер,
            необходимых и достаточных для обеспечения выполнения обязанностей,
            предусмотренных Законом о персональных данных и принятыми в
            соответствии с ним нормативными правовыми актами, если иное не
            предусмотрено Законом о персональных данных или другими
            конституционными законами. <br />3.2. Оператор обязан: <br />–
            предоставлять субъекту персональных данных по его просьбе
            информацию, касающуюся обработки его персональных данных; <br />–
            организовывать обработку персональных данных в порядке,
            установленном действующим законодательством РК; <br />– отвечать на
            обращения и запросы субъектов персональных данных и их законных
            представителей в соответствии с требованиями Закона о персональных
            данных; <br />– сообщать в уполномоченный орган по защите прав
            субъектов персональных данных по запросу этого органа необходимую
            информацию в течение 30 дней с даты получения такого запроса;
            <br />– публиковать или иным образом обеспечивать неограниченный
            доступ к настоящей Политике в отношении обработки персональных
            данных; <br />– принимать правовые, организационные и технические
            меры для защиты персональных данных от неправомерного или случайного
            доступа к ним, уничтожения, изменения, блокирования, копирования,
            предоставления, распространения персональных данных, а также от иных
            неправомерных действий в отношении персональных данных; <br />–
            прекратить передачу (распространение, предоставление, доступ)
            персональных данных, прекратить обработку и уничтожить персональные
            данные в порядке и случаях, предусмотренных Законом о персональных
            данных; <br />– исполнять иные обязанности, предусмотренные Законом
            о персональных данных.
            <br />
            <br />4. Основные права и обязанности субъектов персональных данных
            <br />4.1. Субъекты персональных данных имеют право: <br />–
            получать информацию, касающуюся обработки его персональных данных,
            за исключением случаев, предусмотренных конституционными законами.
            Сведения предоставляются субъекту персональных данных Оператором в
            доступной форме, и в них не должны содержаться персональные данные,
            относящиеся к другим субъектам персональных данных, за исключением
            случаев, когда имеются законные основания для раскрытия таких
            персональных данных. Перечень информации и порядок ее получения
            установлен Законом о персональных данных; <br />– требовать от
            оператора уточнения его персональных данных, их блокирования или
            уничтожения в случае, если персональные данные являются неполными,
            устаревшими, неточными, незаконно полученными или не являются
            необходимыми для заявленной цели обработки, а также принимать
            предусмотренные законом меры по защите своих прав; <br />– выдвигать
            условие предварительного согласия при обработке персональных данных
            в целях продвижения на рынке товаров, работ и услуг; <br />– на
            отзыв согласия на обработку персональных данных; <br />– обжаловать
            в уполномоченный орган по защите прав субъектов персональных данных
            или в судебном порядке неправомерные действия или бездействие
            Оператора при обработке его персональных данных; <br />– на
            осуществление иных прав, предусмотренных законодательством РК.
            <br />4.2. Субъекты персональных данных обязаны: <br />–
            предоставлять Оператору достоверные данные о себе; <br />– сообщать
            Оператору об уточнении (обновлении, изменении) своих персональных
            данных. <br />4.3. Лица, передавшие Оператору недостоверные сведения
            о себе, либо сведения о другом субъекте персональных данных без
            согласия последнего, несут ответственность в соответствии с
            законодательством РК.
            <br />
            <br />5. Оператор может обрабатывать следующие персональные данные
            Пользователя <br />5.1. Фамилия, имя, отчество. <br />5.2. Номера
            телефонов. <br />5.3. Также на сайте происходит сбор и обработка
            обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью
            сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и
            других). <br />5.4. Вышеперечисленные данные далее по тексту
            Политики объединены общим понятием Персональные данные. <br />5.5.
            Обработка специальных категорий персональных данных, касающихся
            расовой, национальной принадлежности, политических взглядов,
            религиозных или философских убеждений, интимной жизни, Оператором не
            осуществляется. <br />5.6. Обработка персональных данных,
            разрешенных для распространения, из числа специальных категорий
            персональных данных, указанных в ч. 1 ст. 10 Закона о персональных
            данных, допускается, если соблюдаются запреты и условия,
            предусмотренные ст. 10.1 Закона о персональных данных. <br />5.7.
            Согласие Пользователя на обработку персональных данных, разрешенных
            для распространения, оформляется отдельно от других согласий на
            обработку его персональных данных. При этом соблюдаются условия,
            предусмотренные, в частности, ст. 10.1 Закона о персональных данных.
            Требования к содержанию такого согласия устанавливаются
            уполномоченным органом по защите прав субъектов персональных данных.
            <br />5.7.1 Согласие на обработку персональных данных, разрешенных
            для распространения, Пользователь предоставляет Оператору
            непосредственно. <br />5.7.2 Оператор обязан в срок не позднее трех
            рабочих дней с момента получения указанного согласия Пользователя
            опубликовать информацию об условиях обработки, о наличии запретов и
            условий на обработку неограниченным кругом лиц персональных данных,
            разрешенных для распространения. <br />5.7.3 Передача
            (распространение, предоставление, доступ) персональных данных,
            разрешенных субъектом персональных данных для распространения,
            должна быть прекращена в любое время по требованию субъекта
            персональных данных. Данное требование должно включать в себя
            фамилию, имя, отчество (при наличии), контактную информацию (номер
            телефона, адрес электронной почты или почтовый адрес) субъекта
            персональных данных, а также перечень персональных данных, обработка
            которых подлежит прекращению. Указанные в данном требовании
            персональные данные могут обрабатываться только Оператором, которому
            оно направлено. <br />5.7.4 Согласие на обработку персональных
            данных, разрешенных для распространения, прекращает свое действие с
            момента поступления Оператору требования, указанного в п. 5.7.3
            настоящей Политики в отношении обработки персональных данных.
            <br />6. Принципы обработки персональных данных <br />6.1. Обработка
            персональных данных осуществляется на законной и справедливой
            основе. <br />6.2. Обработка персональных данных ограничивается
            достижением конкретных, заранее определенных и законных целей. Не
            допускается обработка персональных данных, несовместимая с целями
            сбора персональных данных. <br />6.3. Не допускается объединение баз
            данных, содержащих персональные данные, обработка которых
            осуществляется в целях, несовместимых между собой. <br />6.4.
            Обработке подлежат только персональные данные, которые отвечают
            целям их обработки. <br />6.5. Содержание и объем обрабатываемых
            персональных данных соответствуют заявленным целям обработки. Не
            допускается избыточность обрабатываемых персональных данных по
            отношению к заявленным целям их обработки. <br />6.6. При обработке
            персональных данных обеспечивается точность персональных данных, их
            достаточность, а в необходимых случаях и актуальность по отношению к
            целям обработки персональных данных. Оператор принимает необходимые
            меры и/или обеспечивает их принятие по удалению или уточнению
            неполных или неточных данных. <br />6.7. Хранение персональных
            данных осуществляется в форме, позволяющей определить субъекта
            персональных данных, не дольше, чем этого требуют цели обработки
            персональных данных, если срок хранения персональных данных не
            установлен конституционными законом, договором, стороной которого,
            выгодоприобретателем или поручителем по которому является субъект
            персональных данных. Обрабатываемые персональные данные уничтожаются
            либо обезличиваются по достижении целей обработки или в случае
            утраты необходимости в достижении этих целей, если иное не
            предусмотрено конституционными законом.
            <br />
            <br />7. Цели обработки персональных данных <br />7.1. Цель
            обработки персональных данных Пользователя: <br />– информирование
            Пользователя посредством отправки электронных писем; <br />–
            заключение, исполнение и прекращение гражданско-правовых договоров;
            <br />– предоставление доступа Пользователю к сервисам, информации
            и/или материалам, содержащимся на веб-сайте https://iBridge.com.
            <br />7.2. Также Оператор имеет право направлять Пользователю
            уведомления о новых продуктах и услугах, специальных предложениях и
            различных событиях. Пользователь всегда может отказаться от
            получения информационных сообщений, направив Оператору письмо на
            адрес электронной почты Admissions@ibridge.kz с пометкой «Отказ от
            уведомлений о новых продуктах и услугах и специальных предложениях».
            <br />7.3. Обезличенные данные Пользователей, собираемые с помощью
            сервисов интернет-статистики, служат для сбора информации о
            действиях Пользователей на сайте, улучшения качества сайта и его
            содержания.
            <br />
            <br />8. Правовые основания обработки персональных данных <br />8.1.
            Правовыми основаниями обработки персональных данных Оператором
            являются: <br />– уставные документы Оператора; <br />– договоры,
            заключаемые между оператором и субъектом персональных данных;
            <br />– конституционные законы, иные нормативно-правовые акты в
            сфере защиты персональных данных; <br />– согласия Пользователей на
            обработку их персональных данных, на обработку персональных данных,
            разрешенных для распространения. <br />8.2. Оператор обрабатывает
            персональные данные Пользователя только в случае их заполнения и/или
            отправки Пользователем самостоятельно через специальные формы,
            расположенные на сайте https://iBridge.com или направленные
            Оператору посредством электронной почты. Заполняя соответствующие
            формы и/или отправляя свои персональные данные Оператору,
            Пользователь выражает свое согласие с данной Политикой. <br />8.3.
            Оператор обрабатывает обезличенные данные о Пользователе в случае,
            если это разрешено в настройках браузера Пользователя (включено
            сохранение файлов «cookie» и использование технологии JavaScript).
            <br />8.4. Субъект персональных данных самостоятельно принимает
            решение о предоставлении его персональных данных и дает согласие
            свободно, своей волей и в своем интересе.
            <br />
            <br />9. Условия обработки персональных данных <br />9.1. Обработка
            персональных данных осуществляется с согласия субъекта персональных
            данных на обработку его персональных данных. <br />9.2. Обработка
            персональных данных необходима для достижения целей, предусмотренных
            международным договором Республики Казахстан или законом, для
            осуществления возложенных законодательством Республики Казахстан на
            оператора функций, полномочий и обязанностей. <br />9.3. Обработка
            персональных данных необходима для осуществления правосудия,
            исполнения судебного акта, акта другого органа или должностного
            лица, подлежащих исполнению в соответствии с законодательством
            Республики Казахстан об исполнительном производстве. <br />9.4.
            Обработка персональных данных необходима для исполнения договора,
            стороной которого либо выгодоприобретателем или поручителем по
            которому является субъект персональных данных, а также для
            заключения договора по инициативе субъекта персональных данных или
            договора, по которому субъект персональных данных будет являться
            выгодоприобретателем или поручителем. <br />9.5. Обработка
            персональных данных необходима для осуществления прав и законных
            интересов оператора или третьих лиц либо для достижения общественно
            значимых целей при условии, что при этом не нарушаются права и
            свободы субъекта персональных данных. <br />9.6. Осуществляется
            обработка персональных данных, доступ неограниченного круга лиц к
            которым предоставлен субъектом персональных данных либо по его
            просьбе (далее – общедоступные персональные данные). <br />9.7.
            Осуществляется обработка персональных данных, подлежащих
            опубликованию или обязательному раскрытию в соответствии с
            конституционными законом.
            <br />
            <br />10. Порядок сбора, хранения, передачи и других видов обработки
            персональных данных <br />Безопасность персональных данных, которые
            обрабатываются Оператором, обеспечивается путем реализации правовых,
            организационных и технических мер, необходимых для выполнения в
            полном объеме требований действующего законодательства в области
            защиты персональных данных. <br />10.1. Оператор обеспечивает
            сохранность персональных данных и принимает все возможные меры,
            исключающие доступ к персональным данным неуполномоченных лиц.
            <br />10.2. Персональные данные Пользователя никогда, ни при каких
            условиях не будут переданы третьим лицам, за исключением случаев,
            связанных с исполнением действующего законодательства либо в случае,
            если субъектом персональных данных дано согласие Оператору на
            передачу данных третьему лицу для исполнения обязательств по
            гражданско-правовому договору. <br />10.3. В случае выявления
            неточностей в персональных данных, Пользователь может
            актуализировать их самостоятельно, путем направления Оператору
            уведомление на адрес электронной почты Оператора
            Admissions@ibridge.kz с пометкой «Актуализация персональных данных».
            <br />10.4. Срок обработки персональных данных определяется
            достижением целей, для которых были собраны персональные данные,
            если иной срок не предусмотрен договором или действующим
            законодательством. <br />Пользователь может в любой момент отозвать
            свое согласие на обработку персональных данных, направив Оператору
            уведомление посредством электронной почты на электронный адрес
            Оператора Admissions@ibridge.kz с пометкой «Отзыв согласия на
            обработку персональных данных». <br />10.5. Вся информация, которая
            собирается сторонними сервисами, в том числе платежными системами,
            средствами связи и другими поставщиками услуг, хранится и
            обрабатывается указанными лицами (Операторами) в соответствии с их
            Пользовательским соглашением и Политикой конфиденциальности. Субъект
            персональных данных и/или Пользователь обязан самостоятельно
            своевременно ознакомиться с указанными документами. Оператор не
            несет ответственность за действия третьих лиц, в том числе указанных
            в настоящем пункте поставщиков услуг. <br />10.6. Установленные
            субъектом персональных данных запреты на передачу (кроме
            предоставления доступа), а также на обработку или условия обработки
            (кроме получения доступа) персональных данных, разрешенных для
            распространения, не действуют в случаях обработки персональных
            данных в государственных, общественных и иных публичных интересах,
            определенных законодательством РК. <br />10.7. Оператор при
            обработке персональных данных обеспечивает конфиденциальность
            персональных данных. <br />10.8. Оператор осуществляет хранение
            персональных данных в форме, позволяющей определить субъекта
            персональных данных, не дольше, чем этого требуют цели обработки
            персональных данных, если срок хранения персональных данных не
            установлен конституционными законом, договором, стороной которого,
            выгодоприобретателем или поручителем по которому является субъект
            персональных данных. <br />10.9. Условием прекращения обработки
            персональных данных может являться достижение целей обработки
            персональных данных, истечение срока действия согласия субъекта
            персональных данных или отзыв согласия субъектом персональных
            данных, а также выявление неправомерной обработки персональных
            данных.
            <br />
            <br />11. Перечень действий, производимых Оператором с полученными
            персональными данными <br />11.1. Оператор осуществляет сбор,
            запись, систематизацию, накопление, хранение, уточнение (обновление,
            изменение), извлечение, использование, передачу (распространение,
            предоставление, доступ), обезличивание, блокирование, удаление и
            уничтожение персональных данных. <br />11.2. Оператор осуществляет
            автоматизированную обработку персональных данных с получением и/или
            передачей полученной информации по
            информационно-телекоммуникационным сетям или без таковой.
            <br />
            <br />12. Трансграничная передача персональных данных <br />12.1.
            Оператор до начала осуществления трансграничной передачи
            персональных данных обязан убедиться в том, что иностранным
            государством, на территорию которого предполагается осуществлять
            передачу персональных данных, обеспечивается надежная защита прав
            субъектов персональных данных. <br />12.2. Трансграничная передача
            персональных данных на территории иностранных государств, не
            отвечающих вышеуказанным требованиям, может осуществляться только в
            случае наличия согласия в письменной форме субъекта персональных
            данных на трансграничную передачу его персональных данных и/или
            исполнения договора, стороной которого является субъект персональных
            данных. <br />13. Конфиденциальность персональных данных
            <br />Оператор и иные лица, получившие доступ к персональным данным,
            обязаны не раскрывать третьим лицам и не распространять персональные
            данные без согласия субъекта персональных данных, если иное не
            предусмотрено конституционными законом. <br />14. Заключительные
            положения <br />14.1. Пользователь может получить любые разъяснения
            по интересующим вопросам, касающимся обработки его персональных
            данных, обратившись к Оператору с помощью электронной почты
            Admissions@ibridge.kz. <br />14.2. В данном документе будут отражены
            любые изменения политики обработки персональных данных Оператором.
            Политика действует бессрочно до замены ее новой версией. <br />14.3.
            Актуальная версия Политики в свободном доступе расположена в сети
            Интернет по адресу https://iBridge.com.
          </div>

          <div
            v-if="$i18n.locale == 'en' && modal_type == 'policy'"
            class="h5 fw-400"
          >
            <br />1. iBridge (hereinafter referred to as the Operator) is
            committed to the principle of maintaining the confidentiality of its
            clients. <br />1.1. The operator sets as its most important goal and
            condition for the implementation of its activities the observance of
            human and civil rights and freedoms when processing their personal
            data, including the protection of the rights to privacy, personal
            and family secrets.
            <br />
            <br />1.2. This Operator's policy regarding the processing of
            personal data (hereinafter referred to as the Policy) applies to all
            information that the Operator can obtain about visitors to the
            website https://iBridge.com.
            <br />
            <br />2. Basic concepts used in the Policy <br />2.1. Automated
            processing of personal data - processing of personal data using
            computer technology. <br />2.2. Blocking of personal data - a
            temporary suspension of the processing of personal data (unless the
            processing is necessary to clarify personal data). <br />2.3.
            Website - a set of graphic and information materials, as well as
            computer programs and databases that ensure their availability on
            the Internet at the network address https://iBridge.com. <br />2.4.
            Personal data information system - a set of personal data contained
            in databases, and information technologies and technical means that
            ensure their processing. <br />2.5. Anonymization of personal data
            is actions as a result of which it is impossible to determine,
            without the use of additional information, the belonging of personal
            data to a specific User or other subject of personal data.
            <br />2.6. Processing of personal data - any action (operation) or a
            set of actions (operations) performed using automation tools or
            without using such tools with personal data, including collection,
            recording, systematization, accumulation, storage, clarification
            (update, change), extraction, use, transfer (distribution,
            provision, access), depersonalization, blocking, deletion,
            destruction of personal data. <br />2.7. Operator - a state body, a
            municipal body, a legal entity or an individual, independently or
            jointly with other persons organizing and (or) processing personal
            data, as well as determining the purposes of processing personal
            data, the composition of personal data to be processed, actions
            (operations) performed with personal data. <br />2.8. Personal data
            - any information relating directly or indirectly to a specific or
            identifiable User of the website https://iBridge.com. <br />2.9.
            Personal data permitted by the subject of personal data for
            dissemination - personal data, access of an unlimited number of
            persons to which is provided by the subject of personal data by
            giving consent to the processing of personal data permitted by the
            subject of personal data for dissemination in the manner prescribed
            by the Law on Personal Data (hereinafter - personal data permitted
            for distribution). <br />2.10. User - any visitor to the website
            https://iBridge.com. <br />2.11. Provision of personal data -
            actions aimed at disclosing personal data to a certain person or a
            certain circle of persons. <br />2.12. Dissemination of personal
            data - any actions aimed at disclosing personal data to an
            indefinite circle of persons (transfer of personal data) or at
            acquaintance with the personal data of an unlimited number of
            persons, including the disclosure of personal data in the media,
            posting on information and telecommunication networks or providing
            access to personal data in any other way. <br />2.13. Cross-border
            transfer of personal data - the transfer of personal data to the
            territory of a foreign state to the authority of a foreign state, to
            a foreign individual or foreign legal entity. <br />2.14.
            Destruction of personal data - any actions as a result of which
            personal data are destroyed irrevocably with the impossibility of
            further restoring the content of personal data in the personal data
            information system and (or) material carriers of personal data are
            destroyed.
            <br />
            <br />3. Basic rights and obligations of the Operator <br />3.1. The
            operator has the right to: <br />- receive from the subject of
            personal data reliable information and / or documents containing
            personal data; <br />- if the subject of personal data withdraws
            consent to the processing of personal data, the Operator has the
            right to continue processing personal data without the consent of
            the subject of personal data if there are grounds specified in the
            Law on Personal Data; <br />- independently determine the
            composition and list of measures necessary and sufficient to ensure
            the fulfillment of the obligations provided for by the Law on
            Personal Data and regulatory legal acts adopted in accordance with
            it, unless otherwise provided by the Law on Personal Data or other
            constitutional laws. <br />3.2. The operator is obliged: <br />-
            provide the subject of personal data, upon his request, with
            information regarding the processing of his personal data; <br />-
            organize the processing of personal data in the manner prescribed by
            the current legislation of the Republic of Kazakhstan; <br />-
            respond to requests and inquiries from subjects of personal data and
            their legal representatives in accordance with the requirements of
            the Law on Personal Data; <br />- inform the authorized body for the
            protection of the rights of subjects of personal data at the request
            of this body the necessary information within 30 days from the date
            of receipt of such a request; <br />- publish or otherwise provide
            unrestricted access to this Policy in relation to the processing of
            personal data; <br />- take legal, organizational and technical
            measures to protect personal data from unauthorized or accidental
            access to them, destruction, alteration, blocking, copying,
            provision, distribution of personal data, as well as from other
            illegal actions in relation to personal data; <br />- stop the
            transfer (distribution, provision, access) of personal data, stop
            processing and destroy personal data in the manner and in cases
            provided for by the Law on Personal Data; <br />- perform other
            duties provided for by the Law on Personal Data.
            <br />
            <br />4. Basic rights and obligations of subjects of personal data
            <br />4.1. Personal data subjects have the right to: <br />- to
            receive information regarding the processing of his personal data,
            with the exception of cases provided for by constitutional laws. The
            information is provided to the subject of personal data by the
            Operator in an accessible form, and it should not contain personal
            data relating to other subjects of personal data, unless there are
            legal grounds for disclosing such personal data. The list of
            information and the procedure for obtaining it is established by the
            Law on Personal Data; <br />- require the operator to clarify his
            personal data, block or destroy them if the personal data is
            incomplete, outdated, inaccurate, illegally obtained or not
            necessary for the stated purpose of processing, as well as take
            measures provided by law to protect their rights; <br />- put
            forward a condition of prior consent when processing personal data
            in order to promote goods, works and services on the market; <br />-
            to withdraw consent to the processing of personal data; <br />- to
            appeal to the authorized body for the protection of the rights of
            subjects of personal data or in court the illegal actions or
            inaction of the Operator when processing his personal data; <br />-
            to exercise other rights provided for by the legislation of the
            Republic of Kazakhstan. <br />4.2. Personal data subjects are
            obliged to: <br />- provide the Operator with reliable data about
            yourself; <br />- inform the Operator about the clarification
            (update, change) of their personal data. <br />4.3. Persons who have
            transferred to the Operator inaccurate information about themselves,
            or information about another subject of personal data without the
            consent of the latter, are liable in accordance with the legislation
            of the Republic of Kazakhstan.
            <br />
            <br />5. The operator can process the following personal data of the
            User <br />5.1. Full Name. <br />5.2. Phone numbers. <br />5.3.
            Also, the site collects and processes anonymized data about visitors
            (including cookies) using Internet statistics services (Yandex
            Metrica and Google Analytics and others). <br />5.4. The above data
            hereinafter in the text of the Policy are united by the general
            concept of Personal data. <br />5.5. The processing of special
            categories of personal data concerning race, nationality, political
            views, religious or philosophical beliefs, intimate life is not
            carried out by the Operator. <br />5.6. The processing of personal
            data permitted for distribution from among the special categories of
            personal data specified in Part 1 of Art. 10 of the Law on Personal
            Data is allowed if the prohibitions and conditions provided for in
            Art. 10.1 of the Law on Personal Data. <br />5.7. The User's consent
            to the processing of personal data permitted for distribution is
            drawn up separately from other consents to the processing of his
            personal data. In this case, the conditions provided for, in
            particular, Art. 10.1 of the Law on Personal Data. The requirements
            for the content of such consent are established by the authorized
            body for the protection of the rights of subjects of personal data.
            <br />5.7.1 Consent to the processing of personal data permitted for
            distribution, the User provides to the Operator directly.
            <br />5.7.2 The operator is obliged, no later than three working
            days from the moment of receipt of the specified consent of the
            User, to publish information on the processing conditions, on the
            existence of prohibitions and conditions for the processing of
            personal data by an unlimited number of persons allowed for
            dissemination. <br />5.7.3 The transfer (distribution, provision,
            access) of personal data permitted by the subject of personal data
            for distribution must be stopped at any time at the request of the
            subject of personal data. This requirement should include the last
            name, first name, patronymic (if any), contact information (phone
            number, e-mail address or postal address) of the subject of personal
            data, as well as a list of personal data, the processing of which is
            subject to termination. The personal data specified in this
            requirement can be processed only by the Operator to whom it is
            sent. <br />5.7.4 Consent to the processing of personal data
            permitted for distribution ceases to be effective from the moment
            the Operator receives the request specified in clause 5.7.3 of this
            Policy in relation to the processing of personal data. <br />6.
            Principles of processing personal data <br />6.1. The processing of
            personal data is carried out on a legal and fair basis. <br />6.2.
            The processing of personal data is limited to the achievement of
            specific, predetermined and legitimate purposes. Processing of
            personal data that is incompatible with the purposes of collecting
            personal data is not allowed. <br />6.3. It is not allowed to
            combine databases containing personal data, the processing of which
            is carried out for purposes incompatible with each other. <br />6.4.
            Only personal data that meet the purposes of their processing is
            subject to processing. <br />6.5. The content and volume of the
            processed personal data correspond to the stated purposes of the
            processing. The redundancy of the processed personal data in
            relation to the stated purposes of their processing is not allowed.
            <br />6.6. When processing personal data, the accuracy of personal
            data is ensured, their sufficiency, and, if necessary, relevance in
            relation to the purposes of processing personal data. The operator
            takes the necessary measures and / or ensures their adoption to
            remove or clarify incomplete or inaccurate data. <br />6.7. The
            storage of personal data is carried out in a form that makes it
            possible to determine the subject of personal data, no longer than
            the purpose of processing personal data requires, unless the storage
            period for personal data is established by constitutional law, an
            agreement to which the subject of personal data is a party,
            beneficiary or guarantor. The processed personal data is destroyed
            or depersonalized upon achievement of the processing goals or in
            case of loss of the need to achieve these goals, unless otherwise
            provided by constitutional law.
            <br />
            <br />7. Purposes of personal data processing <br />7.1. The purpose
            of processing the User's personal data: <br />- informing the User
            by sending emails; <br />- conclusion, execution and termination of
            civil contracts; <br />- providing the User with access to services,
            information and / or materials contained on the website
            https://iBridge.com. <br />7.2. The Operator also has the right to
            send the User notifications about new products and services, special
            offers and various events. The user can always refuse to receive
            informational messages by sending an email to the Operator at the
            email address Admissions@ibridge.kz marked "Refusal to notify about
            new products and services and special offers." <br />7.3. Anonymized
            data of Users collected using Internet statistics services are used
            to collect information about the actions of Users on the site,
            improve the quality of the site and its content.
            <br />
            <br />8. Legal basis for the processing of personal data <br />8.1.
            The legal grounds for the processing of personal data by the
            Operator are: <br />- statutory documents of the Operator; <br />-
            contracts concluded between the operator and the subject of personal
            data; <br />- constitutional laws, other regulatory legal acts in
            the field of personal data protection; <br />- the consent of the
            Users to the processing of their personal data, to the processing of
            personal data permitted for distribution. <br />8.2. The Operator
            processes the User's personal data only if they are filled in and /
            or sent by the User independently through special forms located on
            the website https://iBridge.com or sent to the Operator via e-mail.
            By filling out the appropriate forms and / or sending his personal
            data to the Operator, the User agrees with this Policy. <br />8.3.
            The Operator processes anonymized data about the User if it is
            allowed in the settings of the User's browser (the storage of
            cookies and the use of JavaScript technology are enabled).
            <br />8.4. The subject of personal data independently decides on the
            provision of his personal data and gives consent freely, of his own
            free will and in his interest.
            <br />
            <br />9. Conditions for processing personal data <br />9.1. The
            processing of personal data is carried out with the consent of the
            subject of personal data to the processing of his personal data.
            <br />9.2. The processing of personal data is necessary to achieve
            the goals provided for by an international treaty of the Republic of
            Kazakhstan or by law, for the implementation of the functions,
            powers and duties imposed by the legislation of the Republic of
            Kazakhstan on the operator. <br />9.3. The processing of personal
            data is necessary for the administration of justice, the execution
            of a judicial act, an act of another body or official, subject to
            execution in accordance with the legislation of the Republic of
            Kazakhstan on enforcement proceedings. <br />9.4. The processing of
            personal data is necessary for the execution of an agreement, to
            which the subject of personal data is a party or beneficiary or
            guarantor, as well as for concluding an agreement on the initiative
            of the subject of personal data or an agreement under which the
            subject of personal data will be the beneficiary or guarantor.
            <br />9.5. The processing of personal data is necessary to exercise
            the rights and legitimate interests of the operator or third
            parties, or to achieve socially significant goals, provided that
            this does not violate the rights and freedoms of the subject of
            personal data. <br />9.6. The processing of personal data is carried
            out, access to an unlimited number of persons to which is provided
            by the subject of personal data or at his request (hereinafter -
            publicly available personal data). <br />9.7. The processing of
            personal data is carried out, subject to publication or mandatory
            disclosure in accordance with constitutional law.
            <br />
            <br />10. The procedure for collecting, storing, transferring and
            other types of processing of personal data <br />The security of
            personal data processed by the Operator is ensured through the
            implementation of legal, organizational and technical measures
            necessary to fully comply with the requirements of the current
            legislation in the field of personal data protection. <br />10.1.
            The operator ensures the safety of personal data and takes all
            possible measures to exclude access to personal data of unauthorized
            persons. <br />10.2. The User's personal data will never, under any
            circumstances, be transferred to third parties, except for cases
            related to the implementation of current legislation or if the
            subject of personal data has given consent to the Operator to
            transfer data to a third party to fulfill obligations under a civil
            contract. <br />10.3. In the event of inaccuracies in personal data,
            the User can update them independently by sending a notification to
            the Operator to the Operator's e-mail address Admissions@ibridge.kz
            marked "Updating personal data". <br />10.4. The period for
            processing personal data is determined by the achievement of the
            purposes for which the personal data were collected, unless another
            period is provided for by the contract or current legislation.
            <br />The user can at any time revoke his consent to the processing
            of personal data by sending a notification to the Operator via
            e-mail to the Operator's email address Admissions@ibridge.kz with
            the note “Revocation of consent to the processing of personal data”.
            <br />10.5. All information that is collected by third-party
            services, including payment systems, communication facilities and
            other service providers, is stored and processed by the specified
            persons (Operators) in accordance with their User Agreement and
            Privacy Policy. The subject of personal data and / or the User is
            obliged to independently familiarize themselves with these documents
            in a timely manner. The operator is not responsible for the actions
            of third parties, including the service providers specified in this
            clause. <br />10.6. The prohibitions established by the subject of
            personal data on the transfer (except for granting access), as well
            as on the processing or processing conditions (except for gaining
            access) of personal data permitted for dissemination do not apply in
            cases of processing personal data in the state, public and other
            public interests determined by law RK. <br />10.7. When processing
            personal data, the operator ensures the confidentiality of personal
            data. <br />10.8. The operator stores personal data in a form that
            makes it possible to determine the subject of personal data, no
            longer than the purpose of processing personal data requires, if the
            storage period for personal data is not established by
            constitutional law, an agreement to which the subject of personal
            data is a party, beneficiary or guarantor. <br />10.9. A condition
            for terminating the processing of personal data may be the
            achievement of the purposes of processing personal data, the
            expiration of the consent of the subject of personal data or
            withdrawal of consent by the subject of personal data, as well as
            the identification of illegal processing of personal data.
            <br />
            <br />11. List of actions performed by the Operator with the
            received personal data <br />11.1. The operator collects, records,
            systematizes, accumulates, storing, clarifying (updating, changing),
            extracting, using, transferring (distributing, providing,
            accessing), depersonalizing, blocking, deleting and destroying
            personal data. <br />11.2. The operator carries out automated
            processing of personal data with the receipt and / or transmission
            of the information received via information and telecommunication
            networks or without it.
            <br />
            <br />12. Cross-border transfer of personal data <br />12.1. Before
            starting the cross-border transfer of personal data, the operator is
            obliged to make sure that the foreign state, to whose territory it
            is supposed to transfer personal data, provides reliable protection
            of the rights of subjects of personal data. <br />12.2. Cross-border
            transfer of personal data on the territory of foreign states that do
            not meet the above requirements can be carried out only if there is
            a written consent of the subject of personal data to the
            cross-border transfer of his personal data and / or the execution of
            an agreement to which the subject of personal data is a party.
            <br />13. Confidentiality of personal data <br />The operator and
            other persons who have gained access to personal data are obliged
            not to disclose to third parties and not to distribute personal data
            without the consent of the subject of personal data, unless
            otherwise provided by constitutional law. <br />14. Final Provisions
            <br />14.1. The user can get any clarifications on issues of
            interest regarding the processing of his personal data by contacting
            the Operator via e-mail Admissions@ibridge.kz. <br />14.2. This
            document will reflect any changes in the personal data processing
            policy by the Operator. The policy is valid indefinitely until it is
            replaced by a new version. <br />14.3. The current version of the
            Policy is freely available on the Internet at https://iBridge.com.
          </div>
        </div>
      </v-card>
    </v-dialog>
  </footer>
</template>

<i18n>
  {
    "en": {
      "policy":"Privacy Policy",
      "public":"Public offer",
      "rights":"© 2021 iBridge. All rights reserved.",
      "contacts":"To control the quality of the company's work, write your comments and requests:"
    },
    "ru": {
      "policy":"Политика конфиденциальности",
      "public":"Публичная оферта",
      "rights":"© 2021 iBridge. Все права защищены.",
      "contacts":"Для контроля качества работы компании, пишите Ваши замечания и просьбы:"
    }
  }
</i18n>

<script>
export default {
  data: () => ({
    modal_type: 'offer',
    modal: false,
  }),
  mounted() {
    this.$root.$on('openPolicy', () => {
      this.openModal('policy')
    })
  },
  methods: {
    openModal(type) {
      this.modal_type = type
      this.modal = true
    },
    closeModal() {
      this.modal = false
    },
  },
}
</script>

<style scoped lang="scss">
.footer {
  background: $blue-color;

  &-links {
    color: white;
    text-decoration: none;
    transition: 0.3s;
    &:hover {
      color: $orange-color;
    }
  }
}
.line {
  width: 100%;
  border: 1px solid #474747;
}

.my-modal {
  position: relative;
  margin: 130px;
}
.close {
  position: absolute;
  width: 28px;
  height: 28px;
  top: 56px;
  right: 56px;
  z-index: 10000;
  @media (max-width: 600px) {
    top: 28px;
    right: 28px;
  }
}
a {
  text-decoration: none;
}
</style>
